---
kind: method
id: M:Autodesk.Revit.DB.PointLocationOnCurve.Dispose
source: html/46eddb25-cac5-9f1e-d681-a8d77ce216bc.htm
---
# Autodesk.Revit.DB.PointLocationOnCurve.Dispose Method

Releases all resources used by the PointLocationOnCurve

## Syntax (C#)
```csharp
public void Dispose()
```